espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/MGM22/Include/mgm22_usart.h
/* Bit fields for USART EN */
#define _USART_EN_RESETVALUE                    0x00000000UL                            /**< Default value for USART_EN                  */
#define _USART_EN_MASK                          0x00000001UL                            /**< Mask for USART_EN                           */
#define USART_EN_EN                             (0x1UL << 0)                            /**< USART Enable                                */
#define _USART_EN_EN_SHIFT                      0                                       /**< Shift value for USART_EN                    */
#define _USART_EN_EN_MASK                       0x1UL                                   /**< Bit mask for USART_EN                       */
#define _USART_EN_EN_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for USART_EN                   */
#define USART_EN_EN_DEFAULT                     (_USART_EN_EN_DEFAULT << 0)             /**< Shifted mode DEFAULT for USART_EN           */

/* Bit fields for USART CTRL */
#define _USART_CTRL_RESETVALUE                  0x00000000UL                             /**< Default value for USART_CTRL                */
#define _USART_CTRL_MASK                        0xF3FFFF7FUL                             /**< Mask for USART_CTRL                         */
#define USART_CTRL_SYNC                         (0x1UL << 0)                             /**< USART Synchronous Mode                      */
#define _USART_CTRL_SYNC_SHIFT                  0                                        /**< Shift value for USART_SYNC                  */
#define _USART_CTRL_SYNC_MASK                   0x1UL                                    /**< Bit mask for USART_SYNC                     */
#define _USART_CTRL_SYNC_DEFAULT                0x00000000UL                             /**< Mode DEFAULT for USART_CTRL                 */
#define _USART_CTRL_SYNC_DISABLE                0x00000000UL                             /**< Mode DISABLE for USART_CTRL                 */
#define _USART_CTRL_SYNC_ENABLE                 0x00000001UL                             /**< Mode ENABLE for USART_CTRL                  */
#define USART_CTRL_SYNC_DEFAULT                 (_USART_CTRL_SYNC_DEFAULT << 0)          /**< Shifted mode DEFAULT for USART_CTRL         */
#define USART_CTRL_SYNC_DISABLE                 (_USART_CTRL_SYNC_DISABLE << 0)          /**< Shifted mode DISABLE for USART_CTRL         */
#define USART_CTRL_SYNC_ENABLE                  (_USART_CTRL_SYNC_ENABLE << 0)           /**< Shifted mode ENABLE for USART_CTRL          */
#define USART_CTRL_LOOPBK                       (0x1UL << 1)                             /**< Loopback Enable                             */
#define _USART_CTRL_LOOPBK_SHIFT                1                                        /**< Shift value for USART_LOOPBK                */
#define _USART_CTRL_LOOPBK_MASK                 0x2UL                                    /**< Bit mask for USART_LOOPBK                   */
#define _USART_CTRL_LOOPBK_DEFAULT              0x00000000UL                             /**< Mode DEFAULT for USART_CTRL                 */
#define _USART_CTRL_LOOPBK_DISABLE              0x00000000UL                             /**< Mode DISABLE for USART_CTRL                 */
#define _USART_CTRL_LOOPBK_ENABLE               0x00000001UL                             /**< Mode ENABLE for USART_CTRL                  */
#define USART_CTRL_LOOPBK_DEFAULT               (_USART_CTRL_LOOPBK_DEFAULT << 1)        /**< Shifted mode DEFAULT for USART_CTRL         */
#define USART_CTRL_LOOPBK_DISABLE               (_USART_CTRL_LOOPBK_DISABLE << 1)        /**< Shifted mode DISABLE for USART_CTRL         */
#define USART_CTRL_LOOPBK_ENABLE                (_USART_CTRL_LOOPBK_ENABLE << 1)         /**< Shifted mode ENABLE for USART_CTRL          */
#define USART_CTRL_CCEN                         (0x1UL << 2)                             /**< Collision Check Enable                      */
#define _USART_CTRL_CCEN_SHIFT                  2                                        /**< Shift value for USART_CCEN                  */
#define _USART_CTRL_CCEN_MASK                   0x4UL                                    /**< Bit mask for USART_CCEN                     */
#define _USART_CTRL_CCEN_DEFAULT                0x00000000UL                             /**< Mode DEFAULT for USART_CTRL                 */
#define _USART_CTRL_CCEN_DISABLE                0x00000000UL                             /**< Mode DISABLE for USART_CTRL                 */
#define _USART_CTRL_CCEN_ENABLE                 0x00000001UL                             /**< Mode ENABLE for USART_CTRL                  */
#define USART_CTRL_CCEN_DEFAULT                 (_USART_CTRL_CCEN_DEFAULT << 2)          /**< Shifted mode DEFAULT for USART_CTRL         */
#define USART_CTRL_CCEN_DISABLE                 (_USART_CTRL_CCEN_DISABLE << 2)          /**< Shifted mode DISABLE for USART_CTRL         */
#define USART_CTRL_CCEN_ENABLE                  (_USART_CTRL_CCEN_ENABLE << 2)           /**< Shifted mode ENABLE for USART_CTRL          */
#define USART_CTRL_MPM                          (0x1UL << 3)                             /**< Multi-Processor Mode                        */
#define _USART_CTRL_MPM_SHIFT                   3                                        /**< Shift value for USART_MPM                   */
#define _USART_CTRL_MPM_MASK                    0x8UL                                    /**< Bit mask for USART_MPM                      */
#define _USART_CTRL_MPM_DEFAULT                 0x00000000UL                             /**< Mode DEFAULT for USART_CTRL                 */
#define _USART_CTRL_MPM_DISABLE                 0x00000000UL                             /**< Mode DISABLE for USART_CTRL                 */
#define _USART_CTRL_MPM_ENABLE                  0x00000001UL                             /**< Mode ENABLE for USART_CTRL                  */
#define USART_CTRL_MPM_DEFAULT                  (_USART_CTRL_MPM_DEFAULT << 3)           /**< Shifted mode DEFAULT for USART_CTRL         */
#define USART_CTRL_MPM_DISABLE                  (_USART_CTRL_MPM_DISABLE << 3)           /**< Shifted mode DISABLE for USART_CTRL         */
#define USART_CTRL_MPM_ENABLE                   (_USART_CTRL_MPM_ENABLE << 3)            /**< Shifted mode ENABLE for USART_CTRL          */
#define USART_CTRL_MPAB                         (0x1UL << 4)                             /**< Multi-Processor Address-Bit                 */
#define _USART_CTRL_MPAB_SHIFT                  4                                        /**< Shift value for USART_MPAB                  */
#define _USART_CTRL_MPAB_MASK                   0x10UL                                   /**< Bit mask for USART_MPAB                     */
#define _USART_CTRL_MPAB_DEFAULT                0x00000000UL                             /**< Mode DEFAULT for USART_CTRL                 */
#define USART_CTRL_MPAB_DEFAULT                 (_USART_CTRL_MPAB_DEFAULT << 4)          /**< Shifted mode DEFAULT for USART_CTRL         */
#define _USART_CTRL_OVS_SHIFT                   5                                        /**< Shift value for USART_OVS                   */
#define _USART_CTRL_OVS_MASK                    0x60UL                                   /**< Bit mask for USART_OVS                      */
#define _USART_CTRL_OVS_DEFAULT                 0x00000000UL                             /**< Mode DEFAULT for USART_CTRL                 */
#define _USART_CTRL_OVS_X16                     0x00000000UL                             /**< Mode X16 for USART_CTRL                     */
#define _USART_CTRL_OVS_X8                      0x00000001UL                             /**< Mode X8 for USART_CTRL                      */
#define _USART_CTRL_OVS_X6                      0x00000002UL                             /**< Mode X6 for USART_CTRL                      */
#define _USART_CTRL_OVS_X4                      0x00000003UL                             /**< Mode X4 for USART_CTRL                      */
#define USART_CTRL_OVS_DEFAULT                  (_USART_CTRL_OVS_DEFAULT << 5)           /**< Shifted mode DEFAULT for USART_CTRL         */
#define USART_CTRL_OVS_X16                      (_USART_CTRL_OVS_X16 << 5)               /**< Shifted mode X16 for USART_CTRL             */
#define USART_CTRL_OVS_X8                       (_USART_CTRL_OVS_X8 << 5)                /**< Shifted mode X8 for USART_CTRL              */
#define USART_CTRL_OVS_X6                       (_USART_CTRL_OVS_X6 << 5)                /**< Shifted mode X6 for USART_CTRL              */
#define USART_CTRL_OVS_X4                       (_USART_CTRL_OVS_X4 << 5)                /**< Shifted mode X4 for USART_CTRL              */
#define USART_CTRL_CLKPOL                       (0x1UL << 8)                             /**< Clock Polarity                              */
#define _USART_CTRL_CLKPOL_SHIFT                8                                        /**< Shift value for USART_CLKPOL                */
#define _USART_CTRL_CLKPOL_MASK                 0x100UL                                  /**< Bit mask for USART_CLKPOL                   */
#define _USART_CTRL_CLKPOL_DEFAULT              0x00000000UL                             /**< Mode DEFAULT for USART_CTRL                 */
#define _USART_CTRL_CLKPOL_IDLELOW              0x00000000UL                             /**< Mode IDLELOW for USART_CTRL                 */
#define _USART_CTRL_CLKPOL_IDLEHIGH             0x00000001UL                             /**< Mode IDLEHIGH for USART_CTRL                */
#define USART_CTRL_CLKPOL_DEFAULT               (_USART_CTRL_CLKPOL_DEFAULT << 8)        /**< Shifted mode DEFAULT for USART_CTRL         */
#define USART_CTRL_CLKPOL_IDLELOW               (_USART_CTRL_CLKPOL_IDLELOW << 8)        /**< Shifted mode IDLELOW for USART_CTRL         */
#define USART_CTRL_CLKPOL_IDLEHIGH              (_USART_CTRL_CLKPOL_IDLEHIGH << 8)       /**< Shifted mode IDLEHIGH for USART_CTRL        */
#define USART_CTRL_CLKPHA                       (0x1UL << 9)                             /**< Clock Edge For Setup/Sample                 */
#define _USART_CTRL_CLKPHA_SHIFT                9                                        /**< Shift value for USART_CLKPHA                */
#define _USART_CTRL_CLKPHA_MASK                 0x200UL                                  /**< Bit mask for USART_CLKPHA                   */
#define _USART_CTRL_CLKPHA_DEFAULT              0x00000000UL                             /**< Mode DEFAULT for USART_CTRL                 */
#define _USART_CTRL_CLKPHA_SAMPLELEADING        0x00000000UL                             /**< Mode SAMPLELEADING for USART_CTRL           */
#define _USART_CTRL_CLKPHA_SAMPLETRAILING       0x00000001UL                             /**< Mode SAMPLETRAILING for USART_CTRL          */
#define USART_CTRL_CLKPHA_DEFAULT               (_USART_CTRL_CLKPHA_DEFAULT << 9)        /**< Shifted mode DEFAULT for USART_CTRL         */
#define USART_CTRL_CLKPHA_SAMPLELEADING         (_USART_CTRL_CLKPHA_SAMPLELEADING << 9)  /**< Shifted mode SAMPLELEADING for USART_CTRL   */
#define USART_CTRL_CLKPHA_SAMPLETRAILING        (_USART_CTRL_CLKPHA_SAMPLETRAILING << 9) /**< Shifted mode SAMPLETRAILING for USART_CTRL  */
#define USART_CTRL_MSBF                         (0x1UL << 10)                            /**< Most Significant Bit First                  */
#define _USART_CTRL_MSBF_SHIFT                  10                                       /**< Shift value for USART_MSBF                  */
#define _USART_CTRL_MSBF_MASK                   0x400UL                                  /**< Bit mask for USART_MSBF                     */
#define _USART_CTRL_MSBF_DEFAULT                0x00000000UL                             /**< Mode DEFAULT for USART_CTRL                 */
#define _USART_CTRL_MSBF_DISABLE                0x00000000UL                             /**< Mode DISABLE for USART_CTRL                 */
#define _USART_CTRL_MSBF_ENABLE                 0x00000001UL                             /**< Mode ENABLE for USART_CTRL                  */
#define USART_CTRL_MSBF_DEFAULT                 (_USART_CTRL_MSBF_DEFAULT << 10)         /**< Shifted mode DEFAULT for USART_CTRL         */
#define USART_CTRL_MSBF_DISABLE                 (_USART_CTRL_MSBF_DISABLE << 10)         /**< Shifted mode DISABLE for USART_CTRL         */
#define USART_CTRL_MSBF_ENABLE                  (_USART_CTRL_MSBF_ENABLE << 10)          /**< Shifted mode ENABLE for USART_CTRL          */
#define USART_CTRL_CSMA                         (0x1UL << 11)                            /**< Action On Chip Select In Main Mode          */
#define _USART_CTRL_CSMA_SHIFT                  11                                       /**< Shift value for USART_CSMA                  */
#define _USART_CTRL_CSMA_MASK                   0x800UL                                  /**< Bit mask for USART_CSMA                     */
#define _USART_CTRL_CSMA_DEFAULT                0x00000000UL                             /**< Mode DEFAULT for USART_CTRL                 */
#define _USART_CTRL_CSMA_NOACTION               0x00000000UL                             /**< Mode NOACTION for USART_CTRL                */
#define _USART_CTRL_CSMA_GOTOSLAVEMODE          0x00000001UL                             /**< Mode GOTOSLAVEMODE for USART_CTRL           */
#define USART_CTRL_CSMA_DEFAULT                 (_USART_CTRL_CSMA_DEFAULT << 11)         /**< Shifted mode DEFAULT for USART_CTRL         */
#define USART_CTRL_CSMA_NOACTION                (_USART_CTRL_CSMA_NOACTION << 11)        /**< Shifted mode NOACTION for USART_CTRL        */
#define USART_CTRL_CSMA_GOTOSLAVEMODE           (_USART_CTRL_CSMA_GOTOSLAVEMODE << 11)   /**< Shifted mode GOTOSLAVEMODE for USART_CTRL   */
#define USART_CTRL_TXBIL                        (0x1UL << 12)                            /**< TX Buffer Interrupt Level                   */
#define _USART_CTRL_TXBIL_SHIFT                 12                                       /**< Shift value for USART_TXBIL                 */
#define _USART_CTRL_TXBIL_MASK                  0x1000UL                                 /**< Bit mask for USART_TXBIL                    */
#define _USART_CTRL_TXBIL_DEFAULT               0x00000000UL                             /**< Mode DEFAULT for USART_CTRL                 */
#define _USART_CTRL_TXBIL_EMPTY                 0x00000000UL                             /**< Mode EMPTY for USART_CTRL                   */
#define _USART_CTRL_TXBIL_HALFFULL              0x00000001UL                             /**< Mode HALFFULL for USART_CTRL                */
#define USART_CTRL_TXBIL_DEFAULT                (_USART_CTRL_TXBIL_DEFAULT << 12)        /**< Shifted mode DEFAULT for USART_CTRL         */
#define USART_CTRL_TXBIL_EMPTY                  (_USART_CTRL_TXBIL_EMPTY << 12)          /**< Shifted mode EMPTY for USART_CTRL           */
#define USART_CTRL_TXBIL_HALFFULL               (_USART_CTRL_TXBIL_HALFFULL << 12)       /**< Shifted mode HALFFULL for USART_CTRL        */
#define USART_CTRL_RXINV                        (0x1UL << 13)                            /**< Receiver Input Invert                       */
#define _USART_CTRL_RXINV_SHIFT                 13                                       /**< Shift value for USART_RXINV                 */
#define _USART_CTRL_RXINV_MASK                  0x2000UL                                 /**< Bit mask for USART_RXINV                    */
#define _USART_CTRL_RXINV_DEFAULT               0x00000000UL                             /**< Mode DEFAULT for USART_CTRL                 */
#define _USART_CTRL_RXINV_DISABLE               0x00000000UL                             /**< Mode DISABLE for USART_CTRL                 */
#define _USART_CTRL_RXINV_ENABLE                0x00000001UL                             /**< Mode ENABLE for USART_CTRL                  */
#define USART_CTRL_RXINV_DEFAULT                (_USART_CTRL_RXINV_DEFAULT << 13)        /**< Shifted mode DEFAULT for USART_CTRL         */
#define USART_CTRL_RXINV_DISABLE                (_USART_CTRL_RXINV_DISABLE << 13)        /**< Shifted mode DISABLE for USART_CTRL         */
#define USART_CTRL_RXINV_ENABLE                 (_USART_CTRL_RXINV_ENABLE << 13)         /**< Shifted mode ENABLE for USART_CTRL          */
#define USART_CTRL_TXINV                        (0x1UL << 14)                            /**< Transmitter output Invert                   */
#define _USART_CTRL_TXINV_SHIFT                 14                                       /**< Shift value for USART_TXINV                 */
#define _USART_CTRL_TXINV_MASK                  0x4000UL                                 /**< Bit mask for USART_TXINV                    */
#define _USART_CTRL_TXINV_DEFAULT               0x00000000UL                             /**< Mode DEFAULT for USART_CTRL                 */
#define _USART_CTRL_TXINV_DISABLE               0x00000000UL                             /**< Mode DISABLE for USART_CTRL                 */
#define _USART_CTRL_TXINV_ENABLE                0x00000001UL                             /**< Mode ENABLE for USART_CTRL                  */
#define USART_CTRL_TXINV_DEFAULT                (_USART_CTRL_TXINV_DEFAULT << 14)        /**< Shifted mode DEFAULT for USART_CTRL         */
#define USART_CTRL_TXINV_DISABLE                (_USART_CTRL_TXINV_DISABLE << 14)        /**< Shifted mode DISABLE for USART_CTRL         */
#define USART_CTRL_TXINV_ENABLE                 (_USART_CTRL_TXINV_ENABLE << 14)         /**< Shifted mode ENABLE for USART_CTRL          */
#define USART_CTRL_CSINV                        (0x1UL << 15)                            /**< Chip Select Invert                          */
#define _USART_CTRL_CSINV_SHIFT                 15                                       /**< Shift value for USART_CSINV                 */
#define _USART_CTRL_CSINV_MASK                  0x8000UL                                 /**< Bit mask for USART_CSINV                    */
#define _USART_CTRL_CSINV_DEFAULT               0x00000000UL                             /**< Mode DEFAULT for USART_CTRL                 */
#define _USART_CTRL_CSINV_DISABLE               0x00000000UL                             /**< Mode DISABLE for USART_CTRL                 */
#define _USART_CTRL_CSINV_ENABLE                0x00000001UL                             /**< Mode ENABLE for USART_CTRL                  */
#define USART_CTRL_CSINV_DEFAULT                (_USART_CTRL_CSINV_DEFAULT << 15)        /**< Shifted mode DEFAULT for USART_CTRL         */
#define USART_CTRL_CSINV_DISABLE                (_USART_CTRL_CSINV_DISABLE << 15)        /**< Shifted mode DISABLE for USART_CTRL         */
#define USART_CTRL_CSINV_ENABLE                 (_USART_CTRL_CSINV_ENABLE << 15)         /**< Shifted mode ENABLE for USART_CTRL          */
#define USART_CTRL_AUTOCS                       (0x1UL << 16)                            /**< Automatic Chip Select                       */
#define _USART_CTRL_AUTOCS_SHIFT                16                                       /**< Shift value for USART_AUTOCS                */
#define _USART_CTRL_AUTOCS_MASK                 0x10000UL                                /**< Bit mask for USART_AUTOCS                   */
#define _USART_CTRL_AUTOCS_DEFAULT              0x00000000UL                             /**< Mode DEFAULT for USART_CTRL                 */
#define USART_CTRL_AUTOCS_DEFAULT               (_USART_CTRL_AUTOCS_DEFAULT << 16)       /**< Shifted mode DEFAULT for USART_CTRL         */
#define USART_CTRL_AUTOTRI                      (0x1UL << 17)                            /**< Automatic TX Tristate                       */
#define _USART_CTRL_AUTOTRI_SHIFT               17                                       /**< Shift value for USART_AUTOTRI               */
#define _USART_CTRL_AUTOTRI_MASK                0x20000UL                                /**< Bit mask for USART_AUTOTRI                  */
#define _USART_CTRL_AUTOTRI_DEFAULT             0x00000000UL                             /**< Mode DEFAULT for USART_CTRL                 */
#define _USART_CTRL_AUTOTRI_DISABLE             0x00000000UL                             /**< Mode DISABLE for USART_CTRL                 */
#define _USART_CTRL_AUTOTRI_ENABLE              0x00000001UL                             /**< Mode ENABLE for USART_CTRL                  */
#define USART_CTRL_AUTOTRI_DEFAULT              (_USART_CTRL_AUTOTRI_DEFAULT << 17)      /**< Shifted mode DEFAULT for USART_CTRL         */
#define USART_CTRL_AUTOTRI_DISABLE              (_USART_CTRL_AUTOTRI_DISABLE << 17)      /**< Shifted mode DISABLE for USART_CTRL         */
#define USART_CTRL_AUTOTRI_ENABLE               (_USART_CTRL_AUTOTRI_ENABLE << 17)       /**< Shifted mode ENABLE for USART_CTRL          */
#define USART_CTRL_SCMODE                       (0x1UL << 18)                            /**< SmartCard Mode                              */
#define _USART_CTRL_SCMODE_SHIFT                18                                       /**< Shift value for USART_SCMODE                */
#define _USART_CTRL_SCMODE_MASK                 0x40000UL                                /**< Bit mask for USART_SCMODE                   */
#define _USART_CTRL_SCMODE_DEFAULT              0x00000000UL                             /**< Mode DEFAULT for USART_CTRL                 */
#define USART_CTRL_SCMODE_DEFAULT               (_USART_CTRL_SCMODE_DEFAULT << 18)       /**< Shifted mode DEFAULT for USART_CTRL         */
#define USART_CTRL_SCRETRANS                    (0x1UL << 19)                            /**< SmartCard Retransmit                        */
#define _USART_CTRL_SCRETRANS_SHIFT             19                                       /**< Shift value for USART_SCRETRANS             */
#define _USART_CTRL_SCRETRANS_MASK              0x80000UL                                /**< Bit mask for USART_SCRETRANS                */
#define _USART_CTRL_SCRETRANS_DEFAULT           0x00000000UL                             /**< Mode DEFAULT for USART_CTRL                 */
#define USART_CTRL_SCRETRANS_DEFAULT            (_USART_CTRL_SCRETRANS_DEFAULT << 19)    /**< Shifted mode DEFAULT for USART_CTRL         */
#define USART_CTRL_SKIPPERRF                    (0x1UL << 20)                            /**< Skip Parity Error Frames                    */
#define _USART_CTRL_SKIPPERRF_SHIFT             20                                       /**< Shift value for USART_SKIPPERRF             */
#define _USART_CTRL_SKIPPERRF_MASK              0x100000UL                               /**< Bit mask for USART_SKIPPERRF                */
#define _USART_CTRL_SKIPPERRF_DEFAULT           0x00000000UL                             /**< Mode DEFAULT for USART_CTRL                 */
#define USART_CTRL_SKIPPERRF_DEFAULT            (_USART_CTRL_SKIPPERRF_DEFAULT << 20)    /**< Shifted mode DEFAULT for USART_CTRL         */
#define USART_CTRL_BIT8DV                       (0x1UL << 21)                            /**< Bit 8 Default Value                         */
#define _USART_CTRL_BIT8DV_SHIFT                21                                       /**< Shift value for USART_BIT8DV                */
#define _USART_CTRL_BIT8DV_MASK                 0x200000UL                               /**< Bit mask for USART_BIT8DV                   */
#define _USART_CTRL_BIT8DV_DEFAULT              0x00000000UL                             /**< Mode DEFAULT for USART_CTRL                 */
#define USART_CTRL_BIT8DV_DEFAULT               (_USART_CTRL_BIT8DV_DEFAULT << 21)       /**< Shifted mode DEFAULT for USART_CTRL         */
#define USART_CTRL_ERRSDMA                      (0x1UL << 22)                            /**< Halt DMA On Error                           */
